print("""
Задание 3
Есть некоторый текст. Посчитайте в этом тексте количество 
предложений и выведите на экран полученный результат.
""")
######################################################################################

x = input("Введите текст")
sent = 0
for i in x:
    sent += i.count(".") + i.count("!") + i.count("?")
    
print("Количество предложений в тексте: ", sent)

#######################################################################################

x = input("Введите текст")
x = x.split()
znaki = [".", "!", "?", "\n"]
n = 0
i = 0
for el in x:
    if el[-1] in znaki and x[i+1].istitle() or el[-1] in znaki and x[i+1] == None:
        n += 1    
print("Количество предложений в тексте: ", n)

#######################################################################################

